https://drive.google.com/file/d/1etGP85wJWsgqbsh3gX5oxc8dPKLMA1eT/view

https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv
https://raw.githubusercontent.com/justmarkham/DAT8/master/data/beer.txt
https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv
https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/datasets.csv

In [7]:
import pandas as pd

In [77]:
df=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv',sep='\t')

In [67]:
# information about the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [9]:
df.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [78]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [69]:
# Number of unique items in the item_name
df.item_name.nunique()

50

In [79]:
#Extracting the currency column and updating the item_price to numeric
df['Currency']=df.item_price[0][:1]
#df['item_price']=float(df.item_price[0][1:])

In [80]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,Currency
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,$
1,1,1,Izze,[Clementine],$3.39,$
2,1,1,Nantucket Nectar,[Apple],$3.39,$
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,$
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,$

In [76]:
# dispaly unique item_name
df.item_price.nunique(),df.item_price.unique()

(1, array([2.39]))

In [30]:
df.dtypes

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
Currency               object
dtype: object

In [34]:
# Are there any different currencies available?
pd.Categorical(df['Currency'])

['$', '$', '$', '$', '$', ..., '$', '$', '$', '$', '$']
Length: 4622
Categories (1, object): ['$']

In [42]:
c=df.groupby('item_name',sort=True).sum()

In [51]:
c.sort_values(by='quantity',ascending=False,inplace=True)

In [56]:
# Record with maximum orders
c.head(1)

              order_id  quantity  item_price
item_name
Chicken Bowl    713926       761     1735.14

In [64]:
max_price=max(df['item_price'])
min_price=min(df['item_price'])

In [65]:
max_price,min_price

(2.39, 2.39)